098_Мастер_Ра_разработка/src/DataProcessors/ГрупповоеВыставлениеСчетов/ГрупповоеВыставлениеСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрупповоеВыставлениеСчетов</name>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Плательщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.Бренды</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоЗаВесьЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

098_Мастер_Ра_разработка/src/InformationRegisters/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Заказы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыполненияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>DocumentRef.Счет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НадписьНаУпаковке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоризонтальИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВертикальИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопТребованиеКУпаковке</name>
    <type>
      <types>EnumRef.ДопТребованияКУпаковке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тираж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИВремяДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозвратаАкта</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Акт</name>
    <type>
      <types>DocumentRef.Акт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

098_Мастер_Ра_разработка/src/AccumulationRegisters/ВзаиморасчетыПоЗаказам/ВзаиморасчетыПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоЗаказам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Акт</name>
    <type>
      <types>DocumentRef.Акт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>(Общ) Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>(Общ) Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>(Общ) Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
  </enumValues>
</mdclass:Enum>

098_Мастер_Ра_разработка/src/Documents/Счет/Счет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Счет</name>
  <basedOn>Document.Заявка</basedOn>
  <attributes>
    <name>Акт</name>
    <type>
      <types>DocumentRef.Акт</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НДС_В_томЧисле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/DataProcessors/ГрупповоеВыставлениеСчетов/Forms/Форма/Module.bsl
// @strict-types


&НаКлиенте
Процедура Отобрать(Команда)
	ЗаполнитьЗаказыНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказыНаСервере()
	
	Объект.Заказы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 		
		"ВЫБРАТЬ
		|	Заказы.Регистратор КАК Заказ,
		|	Заказы.Регистратор.Менеджер КАК Менеджер,
		|	Заказы.Регистратор.Контрагент КАК Плательщик,
		|	Заказы.Регистратор.Бренд КАК Бренд,
		|	Заказы.Регистратор.НаименованиеЗаказа КАК НазваниеЗаказа,
		|	Заказы.Регистратор.ИтогоЗаВесьЗаказ КАК ИтогоЗаВесьЗаказ,
		|	Заказы.Организация КАК Организация,
		|	Заказы.Регистратор.Дата КАК РегистраторДата,
		|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
		|	Заказы.Регистратор.Проект КАК Проект
		|ИЗ
		|	РегистрСведений.Заказы КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоЗаказам.Остатки КАК ВзаиморасчетыОстатки
		|		ПО Заказы.КодЗаказа = ВзаиморасчетыОстатки.КодЗаказа
		|ГДЕ
		|	Заказы.Счет = ЗНАЧЕНИЕ(Документ.Счет.ПустаяСсылка)
		|	И Заказы.Регистратор.Дата МЕЖДУ &начПериода И &конПериода
		|	И Заказы.Регистратор.НулеваяЦена = ЛОЖЬ
		|	И Заказы.Регистратор.ИтогоЗаВесьЗаказ > 0
		|	И ВзаиморасчетыОстатки.СуммаОстаток > 0";

	Запрос.УстановитьПараметр("начПериода",?(ЗначениеЗаполнено(Период.ДатаНачала),Период.ДатаНачала,Дата(1,1,1)));
	Запрос.УстановитьПараметр("конПериода",?(ЗначениеЗаполнено(Период.ДатаОкончания),Период.ДатаОкончания,КонецГода(ТекущаяДата())));
	
	Если ЗначениеЗаполнено(Менеджер) Тогда 
		Запрос.Текст = Запрос.Текст+" И Заказы.Регистратор.Менеджер = &Менеджер";
		Запрос.УстановитьПараметр("Менеджер",Менеджер);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Запрос.Текст = Запрос.Текст+" И Заказы.Регистратор.Контрагент = &ЮрЛицо";
		Запрос.УстановитьПараметр("ЮрЛицо",Контрагент);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Запрос.Текст = Запрос.Текст + " И Заказы.Регистратор.Проект = &Проект";
		Запрос.УстановитьПараметр("Проект", Проект);
	КонецЕсли;	
		
	Запрос.Текст = Запрос.Текст+" УПОРЯДОЧИТЬ ПО РегистраторДата";

	Результат = Запрос.Выполнить();
	
  	УстановитьПривилегированныйРежим(Истина);
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		новСтрока = Объект.Заказы.Добавить();
		ЗаполнитьЗначенияСвойств(новСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры	

&НаКлиенте
Процедура СоздатьСчета(Команда)
	Если Элементы.Заказы.ВыделенныеСтроки.Количество()>0 Тогда
		Парам = Новый Структура;
		
		ПервСтрока = Объект.Заказы.НайтиПоИдентификатору(Элементы.Заказы.ВыделенныеСтроки.Получить(0));
		Контр	= ПервСтрока.Плательщик;
		ЮЛ 		= ПервСтрока.Организация;

		Для Каждого стр из Элементы.Заказы.ВыделенныеСтроки Цикл	
			текСтрока = Объект.Заказы.НайтиПоИдентификатору(стр);
			Если Контр <> текСтрока.Плательщик Тогда
				Предупреждение("Груповая обработка применима только для счетов на одного заказчика",0,"Ошибка!");
				Возврат;
			КонецЕсли;
			Если ЮЛ <> текСтрока.Организация Тогда
				Предупреждение("Груповая обработка применима только для счетов от одной организации",0,"Ошибка!");
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		СсылкаОбъекта = СоздатьСчет();
		ОткрытьФорму("Документ.Счет.Форма.ФормаДокумента", Новый Структура("Ключ", СсылкаОбъекта));

	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьСчет()	
	
	новСчет = Документы.Счет.СоздатьДокумент();
	новСчет.Дата            = ТекущаяДата();
	
	Для Каждого стр из Элементы.Заказы.ВыделенныеСтроки Цикл	
		текСтрока = Объект.Заказы.НайтиПоИдентификатору(стр);
		НовСчет.Договор 		= текСтрока.Заказ.Договор;
		новСчет.Отвественный	= текСтрока.Менеджер;
		новСчет.Организация 	= текСтрока.Организация;
		новСчет.Контрагент	 	= текСтрока.Плательщик;
		новСчет.БанковскийСчет 	= текСтрока.Организация.БанковскийСчет;
		новСчет.НДС_В_томЧисле  = текСтрока.Организация.НДС_В_томЧисле;

		ИтогоЗаВесьЗаказ = текСтрока.ИтогоЗаВесьЗаказ;
		ДанныеЗаполнения = текСтрока.Заказ; 
				
		новСтрока = новСчет.Товары.Добавить();			
		новСтрока.Количество 	= ДанныеЗаполнения.Тираж;
		новСтрока.КодЗаказа 	= ДанныеЗаполнения.ссылка;
		новСтрока.НДС       	= текСтрока.Организация.СтавкаНДС;
		новСтрока.Номенклатура 	= ДанныеЗаполнения.ИнформацияВСчете;
		новСтрока.СуммаНДС      = ?(новСтрока.НДС = Перечисления.СтавкиНДС.НДС20,ИтогоЗаВесьЗаказ*20/120,0);
		новСтрока.Сумма         = ИтогоЗаВесьЗаказ-новСтрока.СуммаНДС;
		новСтрока.Цена          = ?(новСтрока.Количество=0,0,новСтрока.Сумма/новСтрока.Количество);
		новСтрока.Всего         = ИтогоЗаВесьЗаказ;   
		
	КонецЦикла;
	новСчет.Записать();
	Возврат новСчет.Ссылка;
КонецФункции
